import { AttachmentBuilder } from "discord.js";

// ! ========== المعرفات الأساسية ==========
export const Founder = '1387331972094890036';
export const Owners = ["1387331972094890036", "1387331972094890036", "1387331972094890036", "1387331972094890036"]
export const GuildID = '1497265109247201280';
export const Line = new AttachmentBuilder('line.gif', { name: 'line.gif' })

// ! - اسئلة التفعيل
export const Questions = [
    { question: "1 - يحق لك الذهاب للمراكز الحكوميه اول عشر دقائق ؟", correctAnswer: "خطأ" },
    { question: ": 2 - يحق لك السرقه اول عشر دقائق ؟", correctAnswer: "خطأ" },
    { question: ": 3 - يحق لك تاخذ أسلحه و انت مواطن؟", correctAnswer: "خطأ" },
    { question: ": 4 - هل تتوقف اذا تم تفجير ثلاث كفرات ؟", correctAnswer: "صح" },
    { question: ": 5 - هل يمنع استخدام الايم اسست ؟", correctAnswer: "صح" },
    { question: ": 6 - الـRDM هو الذبح العشوائي ؟", correctAnswer: "صح" },
    { question: ": 7 - الـLAR هو الصدم العشوائي ؟", correctAnswer: "خطأ" },
    { question: ": 8 - هل الـVDM هو عدم رد الخطأ بالخطأ؟", correctAnswer: "خطأ" },
    { question: ": 9 - الحاجز السمعي هو عدم سمع شخص من مسافه بعيده او من وراء الجدران؟", correctAnswer: "صح" },
    { question: ": 10 - هل تستطع ان تطلع الجبل بسيارة صغيره ؟", correctAnswer: "خطأ" },
    { question: ": 11 - هل يمكنك مداهمة المراكز الحكوميه؟", correctAnswer: "خطأ" },
    { question: ": 12 - هل يمكنك تنزيل شخص من السياره؟", correctAnswer: "خطأ" },
    { question: ": 13 - هل يمنع ان تطلق بالآمنه؟", correctAnswer: "صح" },
    { question: ": 14 - هل يمكنك خطف شخص في المنطقة الآمنه؟", correctAnswer: "خطأ" },
    { question: ": 15 - لا تستطيع الازعاج عند المراكز الحكوميه؟", correctAnswer: "صح" }
];

// ! - صلاحيات امر التفعيل
export const CommandTf3el = {
    Permission: '1387331972094890036',
    AddRole: ['1387331972094890036', '1387331972094890036'],
    RemoveRole: '1387331972094890036'
}

// لوق اضافة نقاط
export const LogPoint = {
    Channel: '1387331972094890036',
}

// ! - صلاحيات الاوامر (جميعها للمالك)
export const CommandPremission = {
    Call: '1387331972094890036',
    Ads: '1387331972094890036',
    AddPoint: '1387331972094890036',
    RemovePoint: '1387331972094890036',
    DeletePoint: '1387331972094890036',
    Line: '1387331972094890036',
    SetupAdara: '1387331972094890036',
    SetupID: '1387331972094890036',
    SetupSubmissions: '1387331972094890036',
    SetupTicket: '1387331972094890036',
    Al_ShuriSetup: '1387331972094890036',
    PanelAlShuri: ['1387331972094890036', '1387331972094890036'],
    Al_ShuriVote: ['1387331972094890036'],
    CreateDissenting: '1387331972094890036',
    RemoveDissenting: '1387331972094890036',
    M5alf: '1387331972094890036',
    Remove5alf: '1387331972094890036',
    Employment: '1387331972094890036',
}

// ! - تكت التفعيل
export const TicketTf3el = {
    Support: '1387331972094890036',
    Management: '1387331972094890036',
    Owner: '1387331972094890036',
    Role: '1387331972094890036',
    Parent: '1387331972094890036',
    ChannelLog: '1387331972094890036'
}

// ! - قسم تكت اونر ومساعده وشكاوي
export const Tickets2Sm = {
    Owner: {
        Owner: '1387331972094890036',
        Parent: '1387331972094890036',
        ChannelLog: '1387331972094890036'
    },
    Help: {
        Support: '1387331972094890036',
        Management: '1387331972094890036',
        ToManagement: '1387331972094890036',
        Parent: '1387331972094890036',
        ChannelLog: '1387331972094890036'
    },
    El4away: {
        Support: '1387331972094890036',
        Permission: '1387331972094890036',
        Parent: '1387331972094890036',
        ChannelLog: '1387331972094890036'
    }
}

// ! - تكت تقديم
export const TicketT2dem = {
    Support: '1387331972094890036',
    Parent: '1387331972094890036',
    ChannelLog: '1387331972094890036'
}

// ! - تكت المحكمه
export const TicketM7kma = {
    TlbMo7my: {
        Support: '1387331972094890036',
        Management: '1387331972094890036',
        Role: '1387331972094890036',
        Role1: '1387331972094890036',
        Parent: '1387331972094890036',
        ChannelLog: '1387331972094890036'
    },
    Rf32dea: {
        Support: '1387331972094890036',
        Management: '1387331972094890036',
        Role: '1387331972094890036',
        Parent: '1387331972094890036',
        ChannelLog: '1387331972094890036'
    }
}

// ! - تكت الهيئه
export const TicketHe2a = {
    Support: '1387331972094890036',
    Management: '1387331972094890036',
    ToManagement: '1387331972094890036',
    Parent: '1387331972094890036',
    ChannelLog: '1387331972094890036'
}

// ! - صلاحيات اعلانات
export const PermissionAds = {
    Ads〡1: { Channel: '1387331972094890036', Role: ['1387331972094890036'] },
    Ads〡2: { Channel: '1387331972094890036', Role: ['1387331972094890036'] },
    Ads〡3: { Channel: '1387331972094890036', Role: ['1387331972094890036'] },
    Ads〡4: { Channel: '1387331972094890036', Role: ['1387331972094890036', '1387331972094890036'] },
    Ads〡5: { Channel: '1387331972094890036', Role: ['1387331972094890036'] },
    Ads〡6: { Channel: '1387331972094890036', Role: ['1387331972094890036'] },
    Ads〡7: { Channel: '1387331972094890036', Role: ['1387331972094890036'] },
    Ads〡8: { Channel: '1387331972094890036', Role: ['1387331972094890036'] }
}

// ! - الهوية
export const Identity = {
    Channel: '1387331972094890036',
}

// ! - التقديمات
export const Submissions = {
    Internal: {
        Roles: ['1387331972094890036', '1387331972094890036', '1387331972094890036'],
        Permission: ['1387331972094890036'],
        Channel: '1387331972094890036',
        ChannelAccept: '1387331972094890036',
        ChannelReject: '1387331972094890036'
    },
    Gangs: {
        Roles: ['1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036'],
        Permission: ['1387331972094890036'],
        Channel: '1387331972094890036',
        ChannelAccept: '1387331972094890036',
        ChannelReject: '1387331972094890036'
    },
    Media: {
        Roles: ['1387331972094890036'],
        Permission: ['1387331972094890036'],
        Channel: '1387331972094890036',
        ChannelAccept: '1387331972094890036',
        ChannelReject: '1387331972094890036'
    },
    Justice: {
        Roles: ['1387331972094890036', '1387331972094890036'],
        Permission: ['1387331972094890036', '1387331972094890036'],
        Channel: '1387331972094890036',
        ChannelAccept: '1387331972094890036',
        ChannelReject: '1387331972094890036'
    },
    Consultation: {
        Permission: ['1387331972094890036', '1387331972094890036'],
        Channel: '1387331972094890036',
        ChannelAccept: '1387331972094890036',
        ChannelReject: '1387331972094890036'
    },
    Authority: {
        Permission: ['1387331972094890036', '1387331972094890036'],
        Channel: '1387331972094890036',
        ChannelAccept: '1387331972094890036',
        ChannelReject: '1387331972094890036'
    },
    Resignation: {
        Permission: ['1387331972094890036'],
        Channel: '1387331972094890036',
        ChannelAccept: '1387331972094890036'
    }
}

// ! - المخالفات
export const Violations = {
    Violations: [
        {
            Violation: 'الـهـروب مـن رجـال الآمـن',
            Description: 'تستوجب سجن بمدة : 15دقيقة ومخالفة 7000',
            Price: 7000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'الاسـتـهـزاء بـرجـال الآمـن',
            Description: 'تستوجب سجن بمدة : 20دقيقة ومخالفة20000',
            Price: 20000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'رشـوة مـوظـف حـكـومـي',
            Description: 'تستوجب سجن بمدة : 10دقائق ومخالفة5000',
            Price: 5000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'تـخـريـب مُـمـتـلـكـات الـدولـة',
            Description: 'تستوجب سجن بمدة : 15دقيقة ومخالفة 5000',
            Price: 5000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'عـدم إسـتـخـراج هـويـة',
            Description: 'تستوجب سجن بمدة : 10دقائق ومخالفة1000',
            Price: 1000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'الإصـتـدام بـمـركـبـة حـكـومـيـة',
            Description: 'تستوجب سجن بمدة : 10دقائق ومخالفة5000',
            Price: 5000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'إجـراء سـبـاقـات غـيـر مـرخـصـة (مـع أضـرار أو إصـابـات)',
            Description: 'تستوجب سجن بمدة : 20 دقيقة ومخالفة15000',
            Price: 15000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'إعـاقـة حـركـة سـيـارات الـطـوارئ مـثـل الـشـرطـة والمـركـبـات الـحـكـومـيـة',
            Description: 'تستوجب سجن بمدة : 10دقائق ومخالفة5000',
            Price: 5000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'إيقاف المركبة بشكل يعيق حركة السير',
            Description: '750 قيمة المخالفة',
            Price: 750,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'عـدم إفـسـاح الـطـريـق عـنـد سـمـاع صـافـرة الإنـذار',
            Description: '3000 قيمة المخالفة',
            Price: 3000,
            Emoji: '1387331972094890036'
        },
        {
            Violation: 'الـتـبـاطـؤ فـي الـقـيـادة بـطـريـقـة تـعـرقـل حـركـة الـسـيـر',
            Description: '1500 قيمة المخالفة',
            Price: 1500,
            Emoji: '1387331972094890036'
        },
    ]
}

// ! - العسكري
export const Police = {
    Login: ['1387331972094890036'],
    Logout: ['1387331972094890036'],
    OnDutyList: ['1387331972094890036'],
    ResetOnDutyList: ['1387331972094890036'],
    AddPoint: ['1387331972094890036'],
    RemovePoint: ['1387331972094890036'],
    WhistlingPoint: ['1387331972094890036'],
    PanelM5alfat: '1387331972094890036',
    PanelReport: '1387331972094890036',
    Panel: '1387331972094890036'
}

// ! - البلاغات
export const Reporting = {
    Channel: '1387331972094890036',
    Role: '1387331972094890036'
}

// ! - السجل المدني
export const CivilRegistry = {
    Registry: ['1387331972094890036'],
}

// ! - نقاط الصوت
export const Voice = {
    Voice〡1: { Channel: '1387331972094890036', Role: '1387331972094890036' },
    Voice〡2: { Channel: '1387331972094890036', Role: '1387331972094890036' },
    Voice〡3: { Channel: '1387331972094890036', Role: '1387331972094890036' },
    ChannelJoin: '1387331972094890036',
    ChannelChat: '1387331972094890036'
}

// ! - الشوري
export const AlShuri = {
    Setp1: {
        Channel: '1387331972094890036',
    },
    Channel: '1387331972094890036',
    VoteChannel: '1387331972094890036',
    Democratic: '1387331972094890036',
    Republican: '1387331972094890036',
    Role: '1387331972094890036',
    Leader: '1387331972094890036',
    Deputy: '1387331972094890036'
}

// ! - التوظيف
export const Employment = {
    Channel: '1387331972094890036',
    RoleInterior: '1387331972094890036',
    RoleInterior2: '1387331972094890036',
    RoleInterior3: '1387331972094890036',
    RoleSpecialForces: '1387331972094890036',
    RoleSpecialForces2: '1387331972094890036',
    RoleSpecialForces3: '1387331972094890036',
    Interior: {
        ChiefSergeants: '1387331972094890036',
        FirstSergeants: '1387331972094890036',
        Sergeant: '1387331972094890036',
        StaffSergeants: '1387331972094890036',
        Corporal: '1387331972094890036',
        SoldierFirst: '1387331972094890036',
        Soldier: '1387331972094890036',
        Recruit: '1387331972094890036'
    },
    SpecialForces: {
        ChiefSergeants: '1387331972094890036',
        FirstSergeants: '1387331972094890036',
        Sergeant: '1387331972094890036',
        StaffSergeants: '1387331972094890036',
        Corporal: '1387331972094890036',
        SoldierFirst: '1387331972094890036',
        Soldier: '1387331972094890036',
        Recruit: '1387331972094890036'
    },
    Justice: {
        Role: '1387331972094890036',
        Lawyer: '1387331972094890036',
        Judge: '1387331972094890036'
    },
    AlShuri: {
        Role: '1387331972094890036',
        RepublicanParty: '1387331972094890036',
        DemocraticParty: '1387331972094890036'
    },
    Press: {
        Role: '1387331972094890036',
        Press: '1387331972094890036'
    },
    AntiCorruption: {
        AntiCorruption: '1387331972094890036'
    },
    ElD3sa: {
        Role: '1387331972094890036',
        ElD3sa: '1387331972094890036'
    },
    TheBloods: {
        Role: '1387331972094890036',
        ElNms: '1387331972094890036'
    },
    ElNms: {
        Role: '1387331972094890036',
        ElNms: '1387331972094890036'
    }
}

// ! - العقوبات
export const Dissenting = {
    Channel: '1387331972094890036',
    Role: '1387331972094890036',
}

// ! - التعاميم
export const Circulars = {
    Circular〡1: {
        Channel: '1387331972094890036',
        Role: ['1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036'],
    },
    Circular〡2: {
        Channel: '1387331972094890036',
        Role: ['1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036'],
    },
    Circular〡3: {
        Channel: '1387331972094890036',
        Role: ['1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036', '1387331972094890036'],
    }
}

// ! - استبيانات
export const MainTicket = ({ Admin, Member }) => {
    return `** \`اهـلاً بـك عـزيـزي الـعـضـو\`(<@!${Member}>) \`كـان مـعـك الإداري\`: (<@!${Admin}>) 

\`و أتـمنى بأنـي خـدمـتـك بـالـطـريـقـة الـصـحـيـحـة، عملت جاهدًا لتقديم أفضل خدمة ممكنة، وأعتذر إن بدر مني أي خطأ غير مقصود. أقدر تفهمك ومرونتك.، 

\`إذا كان لديك أي استفسار أو تحتاج إلى مساعدة، فلا تتردد في التواصل مع قولف ريسبكت العظيم وشـكـراً لـك \`**
               ** __\` GULF RESPECT \` __ ** `
}

// ! - الرولات
export const Roles = {
    Admins: [
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036'
    ],
    positions: [
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036'
    ],
    Gangs: [
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036'
    ],
    General: [
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036',
        '1387331972094890036'
    ]
};